analysis/PICRUSt2/Setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Setup</title>
<!-- 2019-05-23 Thu 11:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Yttria" />
</head>
<body>
<div id="content">
<h1 class="title">Setup</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Installing PICRUSt2 and Prerequisites</a>
<ul>
<li><a href="#sec-1-1">1.1. New PICRUSt2 Setup</a></li>
<li><a href="#sec-1-2">1.2. Old PICRUSt2 Setup</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Miniconda install</a></li>
<li><a href="#sec-1-2-2">1.2.2. Build PICRUSt</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Installing PICRUSt2 and Prerequisites</h2>
<div class="outline-text-2" id="text-1">
<p>
The PICRUSt2 pipeline needs two input files: the FASTA sequences to be studied and a BIOM table.
</p>

<p>
These come from the canonical starting files:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>all.seqs.fa</code></td>
</tr>

<tr>
<td class="left"><code>all.biom</code></td>
</tr>
</tbody>
</table>
<p>
It's possible that starting with filtered tables is desirable but I don't know enough at this point to be sure.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> New PICRUSt2 Setup</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Now that PICRUSt2 is available on bioconda, the setup process is much easier:
</p>
<div class="org-src-container">

<pre class="src src-sh">conda create -n picrust2 -c bioconda -c conda-forge picrust2
conda activate picrust2
</pre>
</div>
<p>
(<a href="https://github.com/picrust/picrust2/wiki/Installation#install-from-bioconda">https://github.com/picrust/picrust2/wiki/Installation#install-from-bioconda</a>)
</p>

<p>
However, this wasn't always the case.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Old PICRUSt2 Setup</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This is the process I used to set up a PICRUSt2 environment on Atmosphere in autumn/winter:
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Miniconda install</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
On Atmosphere instances, this has to be done in <code>/scratch</code> or you'll run out of space
on the main drive.
</p>
<div class="org-src-container">

<pre class="src src-sh">curl https://repo.anaconda.com/miniconda/Miniconda3-latest-Linux-x86_64.sh -o Miniconda3.sh
bash Miniconda3.sh
# prompts:
#q
#yes
#
#yes

# close session and reconnect
exit
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Build PICRUSt</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Then PICRUSt2 could be installed from source.  I think in more recent versions 
this process is much simplified, so refer to those instructions: <a href="https://github.com/picrust/picrust2/wiki/Installation#install-from-source">https://github.com/picrust/picrust2/wiki/Installation#install-from-source</a>.
I only include this for documentation purposes.
</p>

<div class="org-src-container">

<pre class="src src-sh"># Make sure /tmp/ has enough space for build
# processes.  On Atmosphere this meant installing Miniconda in /scratch/
git clone https://github.com/picrust/picrust2.git
cd picrust2/placement_tools
sudo apt-get install autotools-dev libtool flex bison cmake automake autoconf
sudo apt-get install libboost-all-dev
# updating gcc on Ubuntu needs an 'unstable' repo
# (maybe this could be done in conda?)
sudo apt-add-repository ppa:ubuntu-toolchain-r/test
sudo apt-get update
sudo apt-get install gcc-4.9
sudo apt-get install g++-4.9
sudo update-alternatives --install /usr/bin/gcc gcc /usr/bin/gcc-4.9 20
sudo update-alternatives --install /usr/bin/g++ g++ /usr/bin/g++-4.9 20

# build epa-ng and gappa
tar -xzf epa-ng-0.2.1-beta-dev.tar.gz
cd epa-ng-0.2.1-beta-dev
make clean
make
ln -s $PWD/bin/epa-ng ~/bin/
cd ../
tar -xzf gappa-0.0.0-dev.tar.gz
cd gappa-0.0.0-dev
make clean
make
ln -s $PWD/bin/gappa ~/bin/
# add that to path
export PATH=~/bin/:$PATH

# PaPaRa
tar -xzf papara_nt-2.5-dev.tar.gz
cd papara_nt-2.5-dev
sh build_papara2.sh
ln -s $PWD/papara ~/bin/

cd ../../
conda env create -f picrust2-env.yaml
source activate picrust2
pip install --upgrade pip
pip install --editable .
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yttria</p>
<p class="date">Created: 2019-05-23 Thu 11:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
